<a href="https://colab.research.google.com/github/piyush-an/OA/blob/main/AkunaCapital.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

In [ ]:
data = [['sch_1', '!@sc_1', 'english maths chemistry'], ['sch_3', '!@sc_2', 'maths biology'], ['sch_2', ')) sc_2', 'english physics chemistry'], ['sch_11', 'sc4', 'english maths chemistry'], ['sch_4', 'sc_2)', 'french physics social_studies'], ['sch_5', 'sc_3#@', 'social_studies maths literature'], ['sch_21', ')) sc_2', 'english physics chemistry'], ['sch_6', '!@sc_2', 'maths biology'], ['sch_14', 'sc_2)', 'french maths english physics'], ['sch_8', 'sc_4#@', 'social_studies maths literature']]

In [ ]:
df = pd.DataFrame(data, columns=['school_id', 'state_code', 'subjects'])

In [ ]:
df

  school_id state_code                         subjects
0     sch_1     !@sc_1          english maths chemistry
1     sch_3     !@sc_2                    maths biology
2     sch_2    )) sc_2        english physics chemistry
3    sch_11        sc4          english maths chemistry
4     sch_4      sc_2)    french physics social_studies
5     sch_5     sc_3#@  social_studies maths literature
6    sch_21    )) sc_2        english physics chemistry
7     sch_6     !@sc_2                    maths biology
8    sch_14      sc_2)     french maths english physics
9     sch_8     sc_4#@  social_studies maths literature

## Step1: Filter `subjects` more than 3 subjects

In [ ]:
df = df[df.subjects.str.split().str.len().gt(2)]

In [ ]:
df

  school_id state_code                         subjects
0     sch_1     !@sc_1          english maths chemistry
2     sch_2    )) sc_2        english physics chemistry
3    sch_11        sc4          english maths chemistry
4     sch_4      sc_2)    french physics social_studies
5     sch_5     sc_3#@  social_studies maths literature
6    sch_21    )) sc_2        english physics chemistry
8    sch_14      sc_2)     french maths english physics
9     sch_8     sc_4#@  social_studies maths literature

## Step2: Filter `state_code` alpha-numeric

In [ ]:
df['state_code'] = df.state_code.str.replace('[^a-zA-Z0-9]', '')

<ipython-input-23-8e366f2c8785>:1: FutureWarning: The default value of regex will change from True to False in a future version.
  df['state_code'] = df.state_code.str.replace('[^a-zA-Z0-9]', '')
<ipython-input-23-8e366f2c8785>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['state_code'] = df.state_code.str.replace('[^a-zA-Z0-9]', '')

In [ ]:
df

  school_id state_code                         subjects
0     sch_1        sc1          english maths chemistry
2     sch_2        sc2        english physics chemistry
3    sch_11        sc4          english maths chemistry
4     sch_4        sc2    french physics social_studies
5     sch_5        sc3  social_studies maths literature
6    sch_21        sc2        english physics chemistry
8    sch_14        sc2     french maths english physics
9     sch_8        sc4  social_studies maths literature

In [ ]:
df = (df.set_index(['school_id', 'state_code'])
   .apply(lambda x: x.str.split(' ').explode())
   .reset_index())

In [ ]:
df

   school_id state_code        subjects
0      sch_1        sc1         english
1      sch_1        sc1           maths
2      sch_1        sc1       chemistry
3      sch_2        sc2         english
4      sch_2        sc2         physics
5      sch_2        sc2       chemistry
6     sch_11        sc4         english
7     sch_11        sc4           maths
8     sch_11        sc4       chemistry
9      sch_4        sc2          french
10     sch_4        sc2         physics
11     sch_4        sc2  social_studies
12     sch_5        sc3  social_studies
13     sch_5        sc3           maths
14     sch_5        sc3      literature
15    sch_21        sc2         english
16    sch_21        sc2         physics
17    sch_21        sc2       chemistry
18    sch_14        sc2          french
19    sch_14        sc2           maths
20    sch_14        sc2         english
21    sch_14        sc2         physics
22     sch_8        sc4  social_studies
23     sch_8        sc4           maths
24     sch_8        sc4      literature

In [ ]:
df = df[df["subjects"].str.contains("english|maths|physics|chemistry")==True]

In [ ]:
df.drop('school_id', inplace=True, axis=1)

In [ ]:
df

   state_code   subjects
0         sc1    english
1         sc1      maths
2         sc1  chemistry
3         sc2    english
4         sc2    physics
5         sc2  chemistry
6         sc4    english
7         sc4      maths
8         sc4  chemistry
10        sc2    physics
13        sc3      maths
15        sc2    english
16        sc2    physics
17        sc2  chemistry
19        sc2      maths
20        sc2    english
21        sc2    physics
23        sc4      maths

In [ ]:
df = pd.crosstab(df['state_code'],df['subjects']).reset_index()

In [ ]:
df = df[["state_code", "english", "maths","physics", "chemistry"]]

In [ ]:
df

subjects state_code  english  maths  physics  chemistry
0               sc1        1      1        0          1
1               sc2        3      1        4          2
2               sc3        0      1        0          0
3               sc4        1      2        0          1

In [ ]:
df